/*
1 Создать классы Кот и Собака. Все животные могут бежать и плыть.
 В качестве параметра каждому методы передается длина препятствия.
 Результатом выполнения действия будет вывод в консоль(Например, dogBobik.run(150); -> “Бобик пробежал 150 м.”.
 Учесть, что у каждого животного есть ограничения на действие( бег: кот 200 м, собака 500 м;
 плавание: кот не умеет плавать, собака 10 м). Добавить подсчет созданных котов, собак и животных


2 Создать класс Сотрудник с полями: ФИО, должность, email, телефон, зарплата и возраст.
Конструктор класса должен заполнять эти поля при создании объекта.
Написать метод в этом классе, который выводит информацию об объекте в консоль в виде красиво оформленной строки.
Создать массив из 5 сотрудников и с помощью цикла foreach вывести информацию только о сотрудниках старше 40 лет
 */


public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}